app/controllers/companies_controller.rb

def show
	@com = Company.find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", "23"]]

def create
	@com = Company.new(params[:company])

if @com.save
---
INSERT INTO "companies" ("address", "approved", "created_at", "description", "member_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)