app/controllers/hotspots_controller.rb

SELECT "hotspots".* FROM "hotspots" WHERE (name LIKE '%b%') ORDER BY name asc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "hotspots" WHERE (name LIKE '%b%')
---
def index
	@hot = Hotspot.search(params[:search]).order(sort_column + ' ' + sort_direction).page(params[:page]).per(5)

SELECT "hotspots".* FROM "hotspots" WHERE "hotspots"."id" = ? LIMIT 1  [["id", "33"]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", 17]]
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 17]]
---
def show
	@hot = Hotspot.find(params[:id])
	com = Company.find(@hot.company_id)
    @memb = Member.find(com.member_id)