app/controllers/members_controller.rb

	  def show
		  @mem = Member.find(params[:id])
      @hot = Hotspot.search(params[:search]).page(params[:page]).per(3)
      @com = Company.find_by_member_id(@mem)
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "23"]]
SELECT "hotspots".* FROM "hotspots" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "hotspots"
SELECT "companies".* FROM "companies" WHERE "companies"."member_id" = 23 LIMIT 1

  	def create
  		@reg = Member.new(params[:member])

  		if @reg.save
---
INSERT INTO "members" ("created_at", "dob", "email", "firstname", "lastname", "password_hash", "password_salt", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at", "user_type", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  	def index
      @hot = Hotspot.page(params[:page]).per(4);
---
SELECT "hotspots".* FROM "hotspots" LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "hotspots"