app/controllers/pages_controller.rb

  def index
  	@reg = Member.new
  	@hot = Hotspot.order("created_at desc").limit(4)
---
SELECT "hotspots".* FROM "hotspots" ORDER BY created_at desc LIMIT 4