app/controllers/remarks_controller.rb

SELECT "hotspots".* FROM "hotspots" WHERE "hotspots"."id" = ? LIMIT 1  [["id", "33"]]
INSERT INTO "remarks" ("created_at", "hotspot_id", "member_id", "remark", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 01 May 2013 02:44:37 UTC +00:00], ["hotspot_id", 33], ["member_id", nil], ["remark", "hi brad ka nice ani oi haha\r\n"], ["updated_at", Wed, 01 May 2013 02:44:37 UTC +00:00]]
---
def create
	@rem = Remark.new(params[:remark])
	@hot = Hotspot.find(params[:remark][:hotspot_id])


	if @rem.save