app/views/hotspots/_hotspots.html.erb

<% @hot.each do |f| %>
  <% @com = Company.find(f.company_id) %>
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", 17]]