app/views/hotspots/show.html.erb

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 17]]
---
    <tr>
      <% mem = Member.find(f.member_id) %>