app/views/members/index.html.erb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", 17]]
---
<% @hot.each do |h| %>
<% @com = Company.find(h.company_id)%>