app/views/members/show.html.erb

  <div id="indivremark">
     <% @hot = Hotspot.find(h.hotspot_id) %>
---
SELECT "hotspots".* FROM "hotspots" WHERE "hotspots"."id" = ? LIMIT 1  [["id", 33]]